# 面向对象概述
# 面向对象（Object Oriented）技术是一种从组织结构上模拟客观世界的方法

# 对象
# 对象（Object），是一个抽象概念，表示任意存在的事物。世间万物皆对象。
# 通常将对象划分为两个部分，即静态部分与动态部分。
# 静态部分被称为“属性”，任何对象都具备自身属性，这些属性不仅是客观存在的，而且是不能被忽视的，如人的性别；
# 动态部分指的是对象的行为，即对象执行的动作，如人可以行走。
# 在Python中，一切都是对象。

# 类
# 类是封装对象的属性和行为的载体，反过来说，具有相同属性和行为的一类实体被称为类。

# 面向对象程序设计的特点
# 面向对象程序设计具有三大基本特征：封装、继承和多态。

# 封装
# 封装是面向对象编程的核心思想，将对象的属性和行为封装起来，而将对象的属性和行为封装起来的载体就是类，类通常对客户隐藏其实现细节。

# 继承
# 继承是实现重复利用的重要手段，子类通过继承复用了父类的属性和行为的同时，又添加了子类特有的属性和行为。
# Python中可以说子类的实例都是父类的实例，但不能说父类的实例是子类的实例

# 多态
# 将父类对象应用于子类的特征就是多态。
# 一个父类衍生出不同的子类，子类继承父类特征的同时，也具备了自己的特征，并且能够实现不同的效果，这就是多态化的结构。






